# EdgeArrayArray Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
EdgeArrayArray Members
EdgeArrayArray Class Constructors Methods Properties See Also
---
The EdgeArrayArray type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| EdgeArrayArray | Initializes a new instance of the EdgeArrayArray class |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Append | Add the edge array to the end of the array. |
| Clear | Removes every edge array from the array, rendering it empty. |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| ForwardIterator | Retrieve a forward moving iterator to the array. |
| GetEnumerator | Retrieve a forward moving iterator to the array. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Insert | Insert the specified edge array into the array. |
| ReverseIterator | Retrieve a backward moving iterator to the array. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Test to see if the array is empty. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| Item | Gets or sets an edge array at a specified index within the array. |
| Size | Returns the number of edge arrays that are in the array. |

# See Also
EdgeArrayArray Class
Autodesk.Revit.DB Namespace